app/Controllers/Client/Reservasi.php

SELECT *
FROM `lapangan`
SELECT `jadwal_lapangan`.*, `lapangan`.`nama_lapangan`
FROM `jadwal_lapangan`
JOIN `lapangan` ON `lapangan`.`id_lapangan` = `jadwal_lapangan`.`id_lapangan`
WHERE `jadwal_lapangan`.`tanggal` = '2026-01-29'
ORDER BY `jadwal_lapangan`.`jam_mulai` ASC
---
    public function index()
    {
        $tanggal = $this->request->getGet('tanggal') ?? date('Y-m-d');
        $idLap = $this->request->getGet('lapangan');

        // 🔹 Ambil semua lapangan (untuk filter dropdown)
        $lapanganModel = new \App\Models\LapanganModel();
        $lapangan = $lapanganModel->findAll();

        // 🔹 Query jadwal
        $builder = $this->jadwal
            ->select('jadwal_lapangan.*, lapangan.nama_lapangan')
            ->join('lapangan', 'lapangan.id_lapangan = jadwal_lapangan.id_lapangan')
            ->where('jadwal_lapangan.tanggal', $tanggal);

        if ($idLap) {
            $builder->where('jadwal_lapangan.id_lapangan', $idLap);
        }

        $data = [
            'tanggal' => $tanggal,   // ✅
            'lapangan' => $lapangan,  // ✅ INI YANG KURANG
            'jadwal' => $builder
                ->orderBy('jadwal_lapangan.jam_mulai', 'ASC')
                ->findAll(),