app/Controllers/Admin/Dashboard.php

        }

        // Ambil data tambahan (total keseluruhan)
        $totalUsers = $this->userModel->where('role', 'client')->countAllResults();
        $totalLapangan = $this->lapanganModel->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `role` = 'client'
SELECT COUNT(*) AS `numrows`
FROM `lapangan`