app/Controllers/Admin/JadwalLapangan.php

    public function index()
    {
        // Auto hapus jadwal kadaluarsa
        $this->hapusJadwalKadaluarsa();

        // Ambil filter
        $id_lapangan = $this->request->getGet('lapangan');
        $tanggal = $this->request->getGet('tanggal') ?: date('Y-m-d');
        $jam = $this->request->getGet('jam');

        $builder = $this->jadwal
            ->select('jadwal_lapangan.*, lapangan.nama_lapangan, reservasi.status as reservasi_status')
            ->join('lapangan', 'lapangan.id_lapangan = jadwal_lapangan.id_lapangan')
            ->join('reservasi', 'reservasi.id_lapangan = jadwal_lapangan.id_lapangan AND reservasi.tanggal = jadwal_lapangan.tanggal AND reservasi.jam_mulai = jadwal_lapangan.jam_mulai', 'left');

        if ($id_lapangan) {
            $builder->where('jadwal_lapangan.id_lapangan', $id_lapangan);
        }

        if ($tanggal) {
            $builder->where('jadwal_lapangan.tanggal', $tanggal);
        }

        if ($jam) {
            $builder->where('jadwal_lapangan.jam_mulai', $jam);
        }

        $data['jadwal'] = $builder
            ->orderBy('tanggal', 'DESC')
            ->orderBy('jam_mulai', 'ASC')
            ->findAll();

        $data['lapangan'] = $this->lapangan->findAll();
---
SELECT `jadwal_lapangan`.*, `lapangan`.`nama_lapangan`, `reservasi`.`status` as `reservasi_status`
FROM `jadwal_lapangan`
JOIN `lapangan` ON `lapangan`.`id_lapangan` = `jadwal_lapangan`.`id_lapangan`
LEFT JOIN `reservasi` ON `reservasi`.`id_lapangan` = `jadwal_lapangan`.`id_lapangan` AND `reservasi`.`tanggal` = `jadwal_lapangan`.`tanggal` AND `reservasi`.`jam_mulai` = `jadwal_lapangan`.`jam_mulai`
WHERE `jadwal_lapangan`.`tanggal` = '2026-02-02'
ORDER BY `tanggal` DESC, `jam_mulai` ASC
SELECT *
FROM `lapangan`