app/Controllers/Admin/Reservasi.php

SELECT *
FROM `riwayat_reservasi`
WHERE `tanggal` >= '2026-01-01'
AND `tanggal` <= '2026-01-31'
---
    public function history()
    {
        $year = $this->request->getGet('year');
        $month = $this->request->getGet('month');

        // Set defaults to current year and month if not provided
        if (!$year) {
            $year = date('Y');
        }
        if (!$month) {
            $month = date('m');
        }

        $query = $this->riwayatReservasi;

        $startDate = $year . '-' . $month . '-01';
        $endDate = date('Y-m-t', strtotime($startDate)); // Last day of the month
        $query = $query->where('tanggal >=', $startDate)
                      ->where('tanggal <=', $endDate);

        $data = [
            'title' => 'Riwayat Reservasi',
            'riwayat' => $query->findAll(),

SELECT *
FROM `riwayat_reservasi`
WHERE `tanggal` >= '2026-01-01'
AND `tanggal` <= '2026-01-31'
---
    public function printHistory()
    {
        $year = $this->request->getGet('year');
        $month = $this->request->getGet('month');

        $query = $this->riwayatReservasi;

        if ($year && $month) {
            $startDate = $year . '-' . $month . '-01';
            $endDate = date('Y-m-t', strtotime($startDate)); // Last day of the month
            $query = $query->where('tanggal >=', $startDate)
                          ->where('tanggal <=', $endDate);
        }

        $riwayat = $query->findAll();

UPDATE `reservasi` SET `status` = 'selesai'
WHERE `reservasi`.`id_reservasi` IN ('7')
SELECT *
FROM `users`
WHERE `users`.`id_user` = '21'
SELECT *
FROM `lapangan`
WHERE `lapangan`.`id_lapangan` = '15'
SELECT *
FROM `riwayat_reservasi`
WHERE `id_reservasi` = '7'
 LIMIT 1
---
    public function updateStatus($id, $status)
    {
        $reservasi = $this->reservasiModel->find($id);

        if (!$reservasi) {
            return redirect()->back()->with('error', 'Reservasi tidak ditemukan');
        }

        // Update status reservasi
        $this->reservasiModel->update($id, [
            'status' => $status
        ]);

        // Handle riwayat reservasi
        if ($status === 'selesai') {
            // Fetch additional data
            $user = $this->userModel->find($reservasi['id_user']);
            $lapangan = $this->lapanganModel->find($reservasi['id_lapangan']);

            // Check if record exists
            $existing = $this->riwayatReservasi->where('id_reservasi', $id)->first();

INSERT INTO `riwayat_reservasi` (`id_reservasi`, `id_user`, `nama_user`, `id_lapangan`, `nama_lapangan`, `tanggal`, `jam_mulai`, `jam_selesai`, `harga_per_jam`, `total_harga`, `status`, `created_at`, `updated_at`) VALUES ('7', '21', 'Perdi Ardiansyah', '15', 'Lapangan D', '2026-01-29', '10:00:00', '11:00:00', '30000', '30000', 'selesai', '2026-01-29 08:15:36', '2026-01-29 08:15:36')
DELETE FROM `riwayat_reservasi`
WHERE `id_reservasi` = '7'
---
            if ($existing) {
                $this->riwayatReservasi->update($existing['id_riwayat'], $dataRiwayat);
            } else {
                $this->riwayatReservasi->insert($dataRiwayat);
            }
        } else {
            // Delete from riwayat if exists
            $this->riwayatReservasi->where('id_reservasi', $id)->delete();