app/Controllers/Auth.php

    public function prosesLogin()
    {
        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        $user = $this->user->where('username', $username)->first();
---
SELECT *
FROM `users`
WHERE `username` = 'duroton'
 LIMIT 1

    public function prosesRegister()
    {
        $rules = [
            'nama' => 'required|is_unique[users.nama]',
            'username' => 'required|is_unique[users.username]',
            'whatsapp' => 'required|numeric|min_length[9]|max_length[15]',
            'password' => 'required|min_length[6]',
        ];

        $messages = [
            'nama' => [
                'is_unique' => 'Nama sudah digunakan'
            ],
            'username' => [
                'is_unique' => 'Username sudah digunakan'
            ],
            'whatsapp' => [
                'required' => 'Nomor WhatsApp harus diisi',
            ]
        ];

        if (!$this->validate($rules, $messages)) {
            return redirect()->back()
                ->withInput()
                ->with('error', $this->validator->getErrors());
        }

        $this->user->insert([
            'nama' => $this->request->getPost('nama'),
            'username' => $this->request->getPost('username'),
            'whatsapp' => '+62' . $this->request->getPost('whatsapp'),
            'password' => password_hash(
                $this->request->getPost('password'),
                PASSWORD_DEFAULT
            ),
            'role' => 'client'
        ]);
---
INSERT INTO `users` (`nama`, `username`, `whatsapp`, `password`, `role`) VALUES ('anak baik banget ', 'anak_banget', '+6282351499650', '$2y$10$JmAlCAU5QPaIyAbxf4TSQOxRlQyyiO/TKGcP9k/0NBl5.K8H7k73q', 'client')