app/Controllers/Lapangan.php

SELECT *
FROM `lapangan`
---
    public function index()
    {
        if (!session()->get('logged_in')) {
            return redirect()->to('/login');
        }

        $role = session()->get('role');

        if (!in_array($role, ['admin'])) {
            return redirect()->to('/unauthorized');
        }

        return view('lapangan/index', [
            'lapangan' => $this->lapangan->findAll()
        ]);