app/Controllers/Profile.php

    public function index()
    {
        $userId = session()->get('id_user');
        $user = $this->userModel->find($userId);
---
SELECT *
FROM `users`
WHERE `users`.`id_user` = '21'