app/Models/ReservasiModel.php

SELECT `reservasi`.*, `users`.`username`, `lapangan`.`nama_lapangan`
FROM `reservasi`
JOIN `users` ON `users`.`id_user` = `reservasi`.`id_user`
JOIN `lapangan` ON `lapangan`.`id_lapangan` = `reservasi`.`id_lapangan`
WHERE `reservasi`.`tanggal` = '2026-01-29'
ORDER BY `reservasi`.`tanggal` DESC, `reservasi`.`jam_mulai` DESC
---
    public function getReservasiAdmin($date = null)
    {
        $query = $this->select('
            reservasi.*,
            users.username,
            lapangan.nama_lapangan
        ')
            ->join('users', 'users.id_user = reservasi.id_user')
            ->join('lapangan', 'lapangan.id_lapangan = reservasi.id_lapangan');

        if ($date) {
            $query->where('reservasi.tanggal', $date);
        }

        return $query->orderBy('reservasi.tanggal', 'DESC')
            ->orderBy('reservasi.jam_mulai', 'DESC')
            ->findAll();